[
  {
    "bookId": 1,
    "bookName": "The Silent Patient",
    "author": "Alex Michaelides",
    "image": "https://lenscratch.com/wp-content/uploads/2022/03/GOST-Books-image.jpg",
    "totalPages": 336,
    "rating": 4.5,
    "category": "Thriller",
    "tags": ["Suspense", "Psychological"],
    "publisher": "Celadon Books",
    "yearOfPublishing": 2019,
    "review": "The Silent Patient is a psychological thriller that explores the human mind. Alicia Berenson is a successful artist who seemingly has the perfect life, but one night, she shoots her husband and then stops speaking. Her silence is as mysterious as the crime itself. Criminal psychotherapist Theo Faber becomes obsessed with unlocking the mystery behind her silence. As he delves into her past, shocking truths about both Alicia and Theo come to light. The novel expertly builds suspense through alternating narratives of Theo's investigation and Alicia's journal entries. The final twist is both unexpected and deeply satisfying, making The Silent Patient a brilliant and thought-provoking read."
  },
  {
    "bookId": 2,
    "bookName": "Atomic Habits",
    "author": "James Clear",
    "image": "https://m.media-amazon.com/images/I/61qXObRoaPL._AC_UF1000,1000_QL80_.jpg",
    "totalPages": 320,
    "rating": 4.8,
    "category": "Self-help",
    "tags": ["Productivity", "Personal Growth"],
    "publisher": "Penguin Random House",
    "yearOfPublishing": 2018,
    "review": "Atomic Habits is a transformative guide to personal development. James Clear breaks down the science behind habits, offering practical strategies to help you form good habits and break bad ones. The book emphasizes the importance of small, consistent changes that compound over time to produce remarkable results. Clear uses real-world examples, scientific research, and engaging anecdotes to explain the mechanics of behavior change. Whether you're trying to improve productivity, health, or relationships, Atomic Habits provides actionable insights that are easy to implement. It’s a must-read for anyone looking to create lasting positive change in their life."
  },
  {
    "bookId": 3,
    "bookName": "The Alchemist",
    "author": "Paulo Coelho",
    "image": "https://gostbooks.com/cdn/shop/files/P3310285_front_cover-web_e8b76a55-7252-4c6a-99b3-92b7dd7c2ba5.jpg?v=1693735295",
    "totalPages": 208,
    "rating": 4.7,
    "category": "Fiction",
    "tags": ["Philosophy", "Adventure"],
    "publisher": "HarperOne",
    "yearOfPublishing": 1988,
    "review": "The Alchemist is a timeless and philosophical novel about pursuing one’s dreams. The story follows Santiago, a shepherd boy, on his journey to find treasure in the Egyptian pyramids. Along the way, he encounters various characters, including an alchemist, who help him discover deeper truths about life, love, and purpose. Paulo Coelho’s writing is simple yet profound, filled with symbolic meaning and life lessons. The novel’s central theme is about listening to your heart and following your personal legend. It’s an inspiring and thought-provoking tale that resonates with readers across generations."
  },
  {
    "bookId": 4,
    "bookName": "Sapiens: A Brief History of Humankind",
    "author": "Yuval Noah Harari",
    "image": "https://gostbooks.com/cdn/shop/files/PA170184-01-LR.jpg?v=1701205120",
    "totalPages": 498,
    "rating": 4.6,
    "category": "Non-fiction",
    "tags": ["History", "Science"],
    "publisher": "Harvill Secker",
    "yearOfPublishing": 2011,
    "review": "Sapiens: A Brief History of Humankind offers a fascinating look at human history, from the emergence of Homo sapiens in Africa to the modern technological age. Yuval Noah Harari explores how humans came to dominate the planet, touching on the Cognitive, Agricultural, and Industrial Revolutions. Harari’s approach is both wide-ranging and accessible, making complex ideas easy to understand. The book raises questions about human evolution, culture, and the future of humanity. It’s an eye-opening exploration that challenges readers to think critically about the past, present, and future of our species."
  },
  {
    "bookId": 5,
    "bookName": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "image": "https://m.media-amazon.com/images/I/611J8UrJy5L._AC_UF894,1000_QL80_.jpg",
    "totalPages": 180,
    "rating": 4.3,
    "category": "Classic",
    "tags": ["Romance", "Drama"],
    "publisher": "Scribner",
    "yearOfPublishing": 1925,
    "review": "The Great Gatsby is a classic American novel that captures the spirit of the Roaring Twenties. Set in 1920s New York, the story centers on Jay Gatsby, a mysterious millionaire, and his obsession with Daisy Buchanan. Through the eyes of narrator Nick Carraway, F. Scott Fitzgerald explores themes of love, wealth, and the American Dream. Gatsby's tragic pursuit of an idealized past ultimately leads to his downfall, making the novel a poignant commentary on the corruption of the American Dream. Fitzgerald's lyrical prose and rich symbolism have made The Great Gatsby a timeless work of literature."
  },
  {
    "bookId": 6,
    "bookName": "Becoming",
    "author": "Michelle Obama",
    "image": "https://gostbooks.com/cdn/shop/files/highvisibilityblazeorange-jacklyn-standard-01-b.jpg?v=1697021322",
    "totalPages": 448,
    "rating": 4.9,
    "category": "Biography",
    "tags": ["Memoir", "Inspiration"],
    "publisher": "Crown Publishing Group",
    "yearOfPublishing": 2018,
    "review": "Becoming is Michelle Obama’s deeply personal memoir that chronicles her journey from growing up on the South Side of Chicago to becoming the First Lady of the United States. The book explores her childhood, education, career, and her life in the White House. Obama writes with honesty and grace, offering readers an intimate glimpse into her life and her struggles with identity, family, and public expectations. Her story is one of resilience, empowerment, and the importance of staying true to oneself. Becoming is not just a memoir; it’s a powerful call to action for women and girls to pursue their dreams."
  },
  {
    "bookId": 7,
    "bookName": "1984",
    "author": "George Orwell",
    "image": "https://www.placartphoto.com/media/PlacArt/Book_Image/image/36662/scaley/400",
    "totalPages": 328,
    "rating": 4.7,
    "category": "Dystopian",
    "tags": ["Political", "Science Fiction"],
    "publisher": "Secker & Warburg",
    "yearOfPublishing": 1949,
    "review": "1984 is George Orwell’s chilling depiction of a dystopian future where totalitarianism reigns supreme. In the novel, the Party controls every aspect of life, even thoughts, through constant surveillance and propaganda. The protagonist, Winston Smith, works for the Party but secretly despises it. Orwell’s portrayal of a world where truth is manipulated and individuality is crushed is both frightening and thought-provoking. 1984 is a timeless warning about the dangers of absolute power and the loss of personal freedoms. The novel’s relevance continues to resonate in today’s political climate, making it a must-read for those interested in political thought."
  },
  {
    "bookId": 8,
    "bookName": "Educated",
    "author": "Tara Westover",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS63pQdXtTDWl_DJ-jJw7VRMKPQuJICEmOQtA&s",
    "totalPages": 334,
    "rating": 4.7,
    "category": "Memoir",
    "tags": ["Inspiration", "Personal Growth"],
    "publisher": "Random House",
    "yearOfPublishing": 2018,
    "review": "Educated is a powerful memoir by Tara Westover, chronicling her journey from an isolated, survivalist upbringing in rural Idaho to earning a PhD from Cambridge University. Raised in a strict, survivalist family, Westover had no formal education until she decided to pursue her own path. The book explores themes of education, family loyalty, and personal identity as Westover struggles to reconcile her past with her desire for knowledge and self-improvement. Her story is both harrowing and inspiring, as it shows the transformative power of education and the strength of the human spirit. Educated is an unforgettable testament to the importance of self-determination."
  },
  {
    "bookId": 9,
    "bookName": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "image": "https://gostbooks.com/cdn/shop/files/2b95a9c0809b45edb09118b1d44be7b7.jpg?v=1686752002",
    "totalPages": 281,
    "rating": 4.9,
    "category": "Classic",
    "tags": ["Justice", "Racial Inequality"],
    "publisher": "J.B. Lippincott & Co.",
    "yearOfPublishing": 1960,
    "review": "To Kill a Mockingbird is a powerful novel that addresses serious issues like racial injustice and moral growth in a small Southern town during the 1930s. The story is narrated by Scout Finch, a young girl whose father, Atticus Finch, is defending a black man falsely accused of raping a white woman. Harper Lee's writing is both gentle and profound, offering readers a look at the innocence of childhood while confronting the harsh realities of prejudice. The novel’s themes of empathy, courage, and morality continue to resonate with readers, making it a seminal work in American literature."
  },
  {
    "bookId": 10,
    "bookName": "The Power of Now",
    "author": "Eckhart Tolle",
    "image": "https://cdn.shopify.com/s/files/1/0053/0681/0736/products/High-visibilityblazeorange_large.png?v=1683744230",
    "totalPages": 236,
    "rating": 4.7,
    "category": "Spirituality",
    "tags": ["Mindfulness", "Inner Peace"],
    "publisher": "New World Library",
    "yearOfPublishing": 1997,
    "review": "The Power of Now by Eckhart Tolle is a spiritual guide that emphasizes the importance of living in the present moment. Tolle argues that many of life’s problems stem from dwelling on the past or worrying about the future. Through mindfulness and meditation, he encourages readers to break free from the cycle of negative thoughts and find inner peace. The book is filled with profound insights about the nature of consciousness and offers practical advice for overcoming ego-driven thinking. It’s a deeply philosophical work that has resonated with millions of readers seeking to live more mindful, fulfilling lives."
  },
  {
    "bookId": 11,
    "bookName": "The Catcher in the Rye",
    "author": "J.D. Salinger",
    "image": "https://m.media-amazon.com/images/I/61syTnICuUL._AC_UF894,1000_QL80_.jpg",
    "totalPages": 277,
    "rating": 4.2,
    "category": "Classic",
    "tags": ["Coming-of-Age", "Identity"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 1951,
    "review": "The Catcher in the Rye is a seminal work in the coming-of-age genre. The novel follows Holden Caulfield, a disillusioned teenager who narrates his experiences in New York City after being expelled from prep school. J.D. Salinger’s portrayal of Holden’s internal struggle with societal expectations and his search for authenticity is both poignant and relatable. The novel captures the confusion, anger, and alienation often associated with adolescence. Holden's desire to protect the innocence of others while grappling with his own transition into adulthood makes The Catcher in the Rye a timeless and deeply reflective novel."
  },
  {
    "bookId": 12,
    "bookName": "The Subtle Art of Not Giving a F*ck",
    "author": "Mark Manson",
    "image": "https://gostbooks.com/cdn/shop/files/05-10-gst034_cover_web.jpg?v=1685031223",
    "totalPages": 224,
    "rating": 4.5,
    "category": "Self-help",
    "tags": ["Personal Growth", "Happiness"],
    "publisher": "HarperOne",
    "yearOfPublishing": 2016,
    "review": "The Subtle Art of Not Giving a F*ck by Mark Manson offers a counterintuitive approach to personal growth and happiness. Manson argues that instead of constantly striving for positivity, people should embrace life’s difficulties and focus on what truly matters. By accepting that life is full of problems, we can prioritize the things that deserve our attention and let go of superficial concerns. The book is written in a conversational, no-nonsense style, with plenty of humor and brutal honesty. Manson’s philosophy is refreshing, challenging traditional self-help advice, and encouraging readers to live more authentically."
  }
]
